# 4.8.THỐNGKÊVÀPHÂNNHÓMDỮLIỆUTRONGPANDAS

ví dụ 4.8.1.1 sử dụng 1 data frame đơn giản gồm 3 cột tuổi chiều cao cân nặng

In [1]:
import pandas as pd 
data = {'tuổi':[16,17,16,18,17], 'chiều cao':[165,170,160,172,168],'cân nặng':[55,60,52,65,58]}
df = pd.DataFrame(data)
df

   tuổi  chiều cao  cân nặng
0    16        165        55
1    17        170        60
2    16        160        52
3    18        172        65
4    17        168        58

kết quả thống kê mô tả

In [2]:
df.describe()

           tuổi   chiều cao   cân nặng
count   5.00000    5.000000   5.000000
mean   16.80000  167.000000  58.000000
std     0.83666    4.690416   4.949747
min    16.00000  160.000000  52.000000
25%    16.00000  165.000000  55.000000
50%    17.00000  168.000000  58.000000
75%    17.00000  170.000000  60.000000
max    18.00000  172.000000  65.000000

In [3]:
df.info

<bound method DataFrame.info of    tuổi  chiều cao  cân nặng
0    16        165        55
1    17        170        60
2    16        160        52
3    18        172        65
4    17        168        58>

### khái niệm IQR

25% (Q1) là tứ phân vị thứ nhất 
50 % (median) trung vị 
75% (Q3)  tứ phân vị thứ 3

vd IQR

In [4]:
df

   tuổi  chiều cao  cân nặng
0    16        165        55
1    17        170        60
2    16        160        52
3    18        172        65
4    17        168        58

tính IQR cho cột chiều cao

In [5]:
q1 = df['chiều cao'].quantile(0.25)
q3 = df['chiều cao'].quantile(0.75)
iqr = q3 - q1
iqr

np.float64(5.0)

Vídụ4.8.1.1

In [4]:
#Ví dụ về phương thức 'describe()' 
data = { 
    'Age':[20,30,35,40,45], 
    'Height':[165,170,175,180,185], 
    'Weight':[60,65,70,75,80] 
} 
 
df=pd.DataFrame(data) 
df.describe()

             Age      Height     Weight
count   5.000000    5.000000   5.000000
mean   34.000000  175.000000  70.000000
std     9.617692    7.905694   7.905694
min    20.000000  165.000000  60.000000
25%    30.000000  170.000000  65.000000
50%    35.000000  175.000000  70.000000
75%    40.000000  180.000000  75.000000
max    45.000000  185.000000  80.000000

4.8.1.2 tính trung bình và độ lệch chuẩn theo cột

4.8.2 phân nhóm dữ liệu với groupby()

ví dụ 4.8.2.1

 Ví dụ 4.8.2.6: tính tổng giá trị của cột 'giatri_1' và trung bình cột 'giatri_2' cho mỗi nhóm

In [8]:
df_data = {'key':['A','B','C','A','B','C'], 'data':range(6)}
df = pd.DataFrame(df_data, columns= ['key', 'data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

tạo đối tượng groupby chưa tính toán

In [9]:
grouped = df.groupby('key')
print("đối tượng groupby", type(grouped))

đối tượng groupby <class 'pandas.core.groupby.generic.DataFrameGroupBy'>

áp dụng phép tổng hợp  (tính toán thực tế)

In [10]:
print("kết quả sau khi áp dụng sum")
print(grouped.sum())

kết quả sau khi áp dụng sum
     data
key
A       3
B       5
C       7

In [11]:
grouped.get_group('A')

  key  data
0   A     0
3   A     3

In [12]:
grouped.get_group('B')

  key  data
1   B     1
4   B     4

In [13]:
grouped.get_group('C')

  key  data
2   C     2
5   C     5

C. các tính năng cơ bản

ví dụ 4.8.2.2

In [14]:
import pandas as pd
data = {'Tên hs':['Bình', 'Hoa','Minh','Lan','Vân'], 
        'Môn':['Toán','Lý','Toán','Hóa','Lý'], 
        'Điểm':[8,9,7,6,8] 
} 
df=pd.DataFrame(data) 
df

  Tên hs   Môn  Điểm
0   Bình  Toán     8
1    Hoa    Lý     9
2   Minh  Toán     7
3    Lan   Hóa     6
4    Vân    Lý     8

In [ ]:
# phân nhóm dữ liệu theo cột môn
grouped_mon = df.groupby('Môn')

In [18]:
grouped_mon.get_group("Toán")

  Tên hs   Môn  Điểm
0   Bình  Toán     8
2   Minh  Toán     7

In [19]:
# truy cập cột điểm của từng nhóm
for ten_mon, df_nhom in grouped_mon:
    print(f"NHÓM:{ten_mon}:")
    print(df_nhom[["Điểm"]])

NHÓM:Hóa:
   Điểm
3     6
NHÓM:Lý:
   Điểm
1     9
4     8
NHÓM:Toán:
   Điểm
0     8
2     7

lập qua từng nhóm

ví dụ 4.8.2.3 tạo data frame (6x3) có cột key gia_tri_1 , gia_tri_2

In [17]:
import numpy as np
import pandas as pd
df = pd.DataFrame(
    {
        'key':['A','B','C','A','B','C'],
        'gia_tri_1':np.random.randint(10,100,6),
        'gia_tri_2':np.random.randint(0,10,6)
        }, 
    columns = ['key', 'gia_tri_1','gia_tri_2'])
print(f"df:\n", df)

df:
   key  gia_tri_1  gia_tri_2
0   A         45          3
1   B         63          4
2   C         89          3
3   A         64          0
4   B         97          8
5   C         61          6

dùng groupby chia bảnh thành 3 nhóm theo các giá trị cột key

In [18]:
for key, giatri in df.groupby('key'):
    print(f"\nkey:", key)
    print("value: \n",giatri)

key: A
value:
   key  gia_tri_1  gia_tri_2
0   A         45          3
3   A         64          0

key: B
value:
   key  gia_tri_1  gia_tri_2
1   B         63          4
4   B         97          8

key: C
value:
   key  gia_tri_1  gia_tri_2
2   C         89          3
5   C         61          6

chọn từng nhóm cụ thể

cú pháp
\grouped = df.groupby('column_name')
grouped.get_group('group_value')

ví dụ 4.8.2.4

In [21]:
print(df.groupby('key').get_group('A'))

  key  gia_tri_1  gia_tri_2
0   A         45          3
3   A         64          0

# 4.8.3 các hàm tổng hợp và biển đổi

In [20]:
# print(df.groupby('key').get_group('A'))
print(df.columns)
print(df.groupby('key').get_group('A'))

Index(['key', 'gia_tri_1', 'gia_tri_2'], dtype='object')
  key  gia_tri_1  gia_tri_2
0   A         45          3
3   A         64          0

# 4.9 Pivot Table & Crosstab trong pandas

load cơ sở dữ liệu titannic và hiện thị 5 mẫu đâu tiên

In [22]:
import pandas as pd
import seaborn as sns
# nạp dữ liệu titannic
titanic_data = sns.load_dataset('titanic')
# hiện thị một số mẫu dữ liệu
titanic_data.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

## 4.9.1 giới thiệu pivot table

4.9.1.1 đặt vấn đề

a) nhắc lại groupby

In [23]:
titanic_data.groupby('sex')['age'].mean()

sex
female    27.915709
male      30.726645
Name: age, dtype: float64

b) tổng hợp dữ liệu theo groupby

In [24]:
gb_age = titanic_data.groupby(['sex','class'])['age'].mean()
gb_age_unstack = gb_age.unstack()
gb_age_unstack

C:\Users\Ngoc Toan\AppData\Local\Temp\ipykernel_18768\1658536313.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  gb_age = titanic_data.groupby(['sex','class'])['age'].mean()

class       First     Second      Third
sex
female  34.611765  28.722973  21.750000
male    41.281386  30.740707  26.507589

### 4.9.1.2 khái niệm Pivot table

###     4.9.1.4 Data Quality Check trước Pivot Table

In [25]:
titanic_data.isna().sum().sort_values(ascending=False)

deck           688
age            177
embarked         2
embark_town      2
sex              0
pclass           0
survived         0
fare             0
parch            0
sibsp            0
class            0
adult_male       0
who              0
alive            0
alone            0
dtype: int64